src/cf/InformationRegisters/инт_АктивныеКонсьюмеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_АктивныеКонсьюмеры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследняяАктивность</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусАктивности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подписка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторФоновогоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_НаправлениеПотокаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_НаправлениеПотокаДанных</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_ПотокиДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПотокиДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаправлениеПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_НаправлениеПотокаДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьОбработанныеСообщенияЧерез</Name>
					<Comment>Количество дней, через которое обработанные сообщения будут удалены(0 - сообщения не удаляются)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валидация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пример</Name>
					<Comment>Сериализованное представление примера исходных данных (ЗначениеВСтрокуВнутр)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АсинхроннаяОбработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Схемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСхемыПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемыеРеквизиты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПодписчикиПотока</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписчик</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписчик</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПодпискиНаВходящиеСообщения</Name>
					<Comment>Источники входящих сообщений (Kafka/RabbitMQ консьюмеры)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подписка</Name>
							<Comment>Подписчик Kafka или RabbitMQ</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.инт_Подписка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/инт_ПодписчикиKafka.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_ПодписчикиKafka</Name>
			<Comment>Подписчики для отправки в Apache Kafka</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Эндпоинт</Name>
					<Comment>Kafka брокер (bootstrap servers)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика в Kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены пакетом в конце обработки потока</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСжатия</Name>
					<Comment>Тип сжатия сообщений (compression.codec для librdkafka)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыСжатияKafka</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяDLQТопика</Name>
					<Comment>Топик для "мёртвых" сообщений (Dead Letter Queue)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/инт_МенеджерВходящихПотоков/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// инт_МенеджерВходящихПотоков
//
// Модуль управления консьюмерами для входящих потоков данных.
// Запускается регламентным заданием, мониторит и перезапускает консьюмеры.
//
// Архитектура:
// - Один консьюмер на группу подписок одного эндпоинта (Kafka брокера)
// - Режим обработки (асинх/синх) определяется настройкой потока данных
// - Валидация и маршрутизация выполняются в инт_КонсьюмерОчередей
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Точка входа регламентного задания.
// Запускает консьюмеры для всех активных входящих потоков.
//
Процедура ЗапуститьКонсьюмерыАсинхронныхПодписок() Экспорт
	
	// Получаем все активные входящие потоки с подписками
	МассивПодписок = ПолучитьАктивныеПодписки();
	
	Если МассивПодписок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Группируем подписки по эндпоинтам
	ПодпискиПоЭндпоинтам = СгруппироватьПодпискиПоЭндпоинтам(МассивПодписок);
	
	// Запускаем консьюмер для каждой группы эндпоинтов
	Для Каждого КлючЗначение Из ПодпискиПоЭндпоинтам Цикл
		ОбработатьПодпискиЭндпоинта(КлючЗначение.Значение);
	КонецЦикла;
	
	// Очищаем записи об остановленных заданиях
	ОчиститьНеактивныеЗаписи();
	
КонецПроцедуры

// Принудительно останавливает все консьюмеры.
//
Процедура ОстановитьВсеКонсьюмеры() Экспорт
	
	АктивныеКонсьюмеры = РегистрыСведений.инт_АктивныеКонсьюмеры.ПолучитьАктивныеКонсьюмеры();
	
	Для Каждого Запись Из АктивныеКонсьюмеры Цикл
		Попытка
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.ИдентификаторФоновогоЗадания);
			Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				Задание.Отменить();
			КонецЕсли;
		Исключение
			// Задание могло завершиться самостоятельно
		КонецПопытки;
		
		РегистрыСведений.инт_АктивныеКонсьюмеры.УдалитьКонсьюмер(
			Запись.Подписка, 
			Запись.ИдентификаторФоновогоЗадания);
	КонецЦикла;
	
КонецПроцедуры

// Останавливает консьюмеры для указанной подписки.
//
// Параметры:
//  Подписка - ОпределяемыйТип.инт_Подписка - Ссылка на подписчика Kafka/RabbitMQ
//
Процедура ОстановитьКонсьюмерыПодписки(Подписка) Экспорт
	
	АктивныеКонсьюмеры = РегистрыСведений.инт_АктивныеКонсьюмеры.ПолучитьАктивныеКонсьюмеры(Подписка);
	
	Для Каждого Запись Из АктивныеКонсьюмеры Цикл
		Попытка
			Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.ИдентификаторФоновогоЗадания);
			Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
				Задание.Отменить();
			КонецЕсли;
		Исключение
			// Задание могло завершиться самостоятельно
		КонецПопытки;
		
		РегистрыСведений.инт_АктивныеКонсьюмеры.УдалитьКонсьюмер(
			Запись.Подписка, 
			Запись.ИдентификаторФоновогоЗадания);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает все активные подписки для входящих потоков.
//
// Возвращаемое значение:
//  Массив из Структура:
//   * ПотокДанных - СправочникСсылка.инт_ПотокиДанных
//   * Подписка    - СправочникСсылка.инт_ПодписчикиKafka
//
Функция ПолучитьАктивныеПодписки()
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПотокиДанных.Ссылка КАК ПотокДанных,
		|	ПодпискиТЧ.Подписка КАК Подписка
		|ИЗ
		|	Справочник.инт_ПотокиДанных КАК ПотокиДанных
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.инт_ПотокиДанных.ПодпискиНаВходящиеСообщения КАК ПодпискиТЧ
		|		ПО ПотокиДанных.Ссылка = ПодпискиТЧ.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.инт_ПодписчикиKafka КАК ПодписчикиKafka
		|		ПО ПодпискиТЧ.Подписка = ПодписчикиKafka.Ссылка
		|ГДЕ
		|	ПотокиДанных.Активен = ИСТИНА
		|	И ПотокиДанных.НаправлениеПотока = ЗНАЧЕНИЕ(Перечисление.инт_НаправлениеПотокаДанных.Входящий)
		|	И ПодписчикиKafka.Активен = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтрокаПодписки = Новый Структура("ПотокДанных, Подписка");
		ЗаполнитьЗначенияСвойств(СтрокаПодписки, Выборка);
		Результат.Добавить(СтрокаПодписки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Обрабатывает подписки одного эндпоинта — запускает консьюмер, если его нет.
//
// Параметры:
//  МассивПодписок - Массив из Структура - Подписки одного эндпоинта
//
Процедура ОбработатьПодпискиЭндпоинта(МассивПодписок)
	
	Если МассивПодписок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем наличие активного консьюмера
	// Используем первую подписку как идентификатор группы
	ПерваяПодписка = МассивПодписок[0].Подписка;
	АктивныеКонсьюмеры = РегистрыСведений.инт_АктивныеКонсьюмеры.ПолучитьАктивныеКонсьюмеры(ПерваяПодписка);
	
	Для Каждого Запись Из АктивныеКонсьюмеры Цикл
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.ИдентификаторФоновогоЗадания);
		Если Задание <> Неопределено И Задание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			// Консьюмер активен, выходим
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	// Запускаем консьюмер
	ЗапуститьКонсьюмер(МассивПодписок);
	
КонецПроцедуры

// Проверяет наличие активного фонового задания для консьюмера.
//
// Возвращаемое значение:
//  Булево - Истина, если есть активное задание
//
Функция ЕстьАктивноеЗаданиеКонсьюмера()
	
	АктивныеЗадания = ФоновыеЗадания.ПолучитьФоновыеЗадания(
		Новый Структура("ИмяМетода, Состояние", 
			"инт_КонсьюмерОчередей.ЧитатьСообщения",
			СостояниеФоновогоЗадания.Активно));
	
	Возврат АктивныеЗадания.Количество() > 0;
	
КонецФункции

// Группирует подписки по эндпоинтам Kafka.
//
// Параметры:
//  МассивПодписок - Массив из Структура - Подписки для группировки
//
// Возвращаемое значение:
//  Соответствие - Ключ: СправочникСсылка.инт_Эндпоинты, Значение: Массив подписок
//
Функция СгруппироватьПодпискиПоЭндпоинтам(МассивПодписок)
	
	Результат = Новый Соответствие;
	
	Для Каждого СтрокаПодписки Из МассивПодписок Цикл
		// Получаем эндпоинт подписчика
		Эндпоинт = СтрокаПодписки.Подписка.Эндпоинт;
		
		Если Результат.Получить(Эндпоинт) = Неопределено Тогда
			Результат.Вставить(Эндпоинт, Новый Массив);
		КонецЕсли;
		
		Результат.Получить(Эндпоинт).Добавить(СтрокаПодписки);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Запускает консьюмер для группы подписок.
//
// Параметры:
//  МассивПодписок - Массив из Структура - Подписки одного эндпоинта
//
Процедура ЗапуститьКонсьюмер(МассивПодписок)
	
	Если МассивПодписок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Формируем параметры для ФЗ
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(МассивПодписок);
	
	// Запускаем ФЗ
	Задание = ФоновыеЗадания.Выполнить(
		"инт_КонсьюмерОчередей.ЧитатьСообщения",
		ПараметрыЗадания,
		,
		"Консьюмер входящих сообщений");
	
	// Регистрируем консьюмер в регистре (используем первую подписку как идентификатор группы)
	РегистрыСведений.инт_АктивныеКонсьюмеры.ЗарегистрироватьКонсьюмер(
		МассивПодписок[0].Подписка,
		Задание.УникальныйИдентификатор,
		"Kafka");
	
КонецПроцедуры

// Очищает записи о неактивных фоновых заданиях.
//
Процедура ОчиститьНеактивныеЗаписи()
	
	АктивныеКонсьюмеры = РегистрыСведений.инт_АктивныеКонсьюмеры.ПолучитьАктивныеКонсьюмеры();
	
	Для Каждого Запись Из АктивныеКонсьюмеры Цикл
		Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Запись.ИдентификаторФоновогоЗадания);
		
		Если Задание = Неопределено ИЛИ Задание.Состояние <> СостояниеФоновогоЗадания.Активно Тогда
			РегистрыСведений.инт_АктивныеКонсьюмеры.УдалитьКонсьюмер(
				Запись.Подписка, 
				Запись.ИдентификаторФоновогоЗадания);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
